#include <iostream>
#include <string>
using namespace std;

string one[] = { "", "один", "два", "три", "чотири", "п'€ть", "ш≥сть", "с≥м", "в≥с≥м", "дев'€ть", "дес€ть", "одинадц€ть", "дванадц€ть", "тринадц€ть", "чотирнадц€ть", "п'€тнадц€ть", "ш≥стнадц€ть", "с≥мнадц€ть", "в≥с≥мнадц€ть", "дев'€тнадц€ть" };
string ten[] = { "", "", "двадц€ть", "тридц€ть", "сорок", "п'€тдес€т", "ш≥стдес€т", "с≥мдес€т", "в≥с≥мдес€т", "дев'€носто" };
string hundred[] = { "", "сто", "дв≥ст≥", "триста", "чотириста", "п'€тсот", "ш≥стсот", "с≥мсот", "в≥с≥мсот", "дев'€тсот" };

string numToWords(int n) {
    if (n == 0) return "нуль";
    if (n == 1000) return "тис€ча";
    string result = "";
    if (n / 100 > 0) {
        result += hundred[n / 100] + " ";
        n %= 100;
    }
    if (n >= 20) {
        result += ten[n / 10] + " ";
        n %= 10;
    }
    if (n > 0) {
        result += one[n] + " ";
    }
    return result;
}

int main() {
    int n;
    cout << "¬вед≥ть число (не б≥льше 1000): ";
    cin >> n;
    if (n <= 1000) {
        cout << numToWords(n) << endl;
    } else {
        cout << "„исло перевищуЇ 1000" << endl;
    }
    return 0;
}